#+title: Write conf files to disk

  #+begin_src bash :tangle ./bash/.shell_scripts :mkdirp yes

     #!/bin/bash
     # run " . shell_scripts" to add the functions defined in this library
     # use cglibdoc to show a list of available functions
     # SEE ALSO:  bsfl
     # CGeng $10-Nov-2013$
     # TODO: Enforce the google shell script style guide
     # https://google.github.io/styleguide/shell.xml#Naming_Conventions

     cglibdoc()
     {
         helptext="\n
        # functions available in cglib : \n
        # \n
        # :: DOC :: \n
        # cglibdoc()                - Display this help \n
        # \n
        # :: SEARCH ::  \n
        # findbydate         - does what it says \n
        # findlargefiles     - does what it says \n
        # \n
        # :: STRING and file TOOLS ::  \n
        # rmdoubleEmptyLines - remove double empty lines  \n
        # deblank()          - remove all white space from string \n
        # deblankleading()   - trim leading white space from string \n
        # uptimel ()         - uptime
        #
        # deblanktrailing()  - trim trailing white space from string \n
        # int2str0()         - int2str0(int1,int2): converts int1 to string with int2 trailing blanks \n
        # lc()               - convert to lower case \n
        # getext()           - return extension , usage: mpath=`getpath PATHNAME` \n
        # getpath()           - return path  \n
        # getbase()          - return basename \n
        # fileparts          - obsolete (multiple return args not working!)  \n
        # datetoday ()       - get the current date as dd-month-yyyy \n
        # \n
        # :: Summaries :: \n
        # compi              - summary information about this computer
        # \n
        # :: FILESYSTEM UTILS :: \n
        # freeram()          - clean up RAM
        # fsinfo()           - info about filesystem
        #
        # :: SOUND MP3 ::  \n
        # mp4toaudio()       - TODO extract sound from mp4 videos  \\
**** Hardware info

#+begin_src bash  :tangle ./bash/.shell_scripts :mkdirp yes :results output raw
  function hw() {
    for d in system-manufacturer system-product-name system-serial-number system-version bios-release-date bios-version
    do
          echo "${d^} : " $(sudo dmidecode -s $d);
    done
  }
#+end_src

#+RESULTS:
System-manufacturer :  HP
System-product-name :  HP Pavilion Gaming Laptop 15-cx0xxx
System-version :  Type1ProductConfigId
Bios-release-date :  10/11/2018
Bios-version :  F.12

